Revit 2027 API
IFCData.CreateStringOfType Method
 Creates a string data object of the specified type.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IFCData CreateStringOfType(
	string value,
	string typeName
)
Public Shared Function CreateStringOfType (
	value As String,
	typeName As String
) As IFCData
public:
static IFCData^ CreateStringOfType(
	String^ value,
	String^ typeName
)
static member CreateStringOfType :
        value : string *
        typeName : string -> IFCData
Parameters
value String
 The string value.
typeName String
 The type name.
Return Value
IFCData
 The IFCData object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCData Class
Autodesk.Revit.DB.IFC Namespace